/** 全局正则表达式 */

export default {
  /** 大于0的数字 */
  number: /^[1-9][0-9]*$/,
  /** 判断是数字 */
  isNumber: /^[+-]?\d*(\.\d*)?(e[+-]?\d+)?$/,
  /** 英文加数字 3位数以上 */
  password: /^[a-zA-Z0-9]{3,12}$/,
  /** 匹配手机号码 */
  tel: /^(0|86|17951)?(13[0-9]|14[0-9]|15[0-9]|16[0-9]|17[0-9]|18[0-9])[0-9]{8}$/i,
  /** 密码正则（密码格式应为8-18位数字、字母、符号的任意两种组合） */
  REGEXP_PWD:
    /^(?![0-9]+$)(?![a-z]+$)(?![A-Z]+$)(?!([^(0-9a-zA-Z)]|[()])+$)(?!^.*[\u4E00-\u9FA5].*$)([^(0-9a-zA-Z)]|[()]|[a-z]|[A-Z]|[0-9]){8,18}$/,
  /** 名称.字段组合,多行使用换行符 */
  nameMap: /^([a-zA-Z0-9_.]|(.+\.))+(?:\n([a-zA-Z0-9_.]|(.+\.))+)*$/,
  /** 匹配邮箱 */
  email: /^([a-zA-Z0-9_-])+@([a-zA-Z0-9_-])+(.[a-zA-Z0-9_-])+/,
};
